       IDENTIFICATION   DIVISION.
       PROGRAM-ID.      prog.
       DATA             DIVISION.
       WORKING-STORAGE  SECTION.
       01 X-P1          PIC 9(1) VALUE 1.
       01 X-P2          PIC 9(2) VALUE 12.
       01 X-P3          PIC 9(3) VALUE 123.
       01 X-P4          PIC 9(4) VALUE 1234.
       01 X-P5          PIC 9(5) VALUE 12345.
       01 X-P6          PIC 9(6) VALUE 123456.
       01 X-P7          PIC 9(7) VALUE 1234567.
       01 X-P8          PIC 9(8) VALUE 12345678.
       01 X-P9          PIC 9(9) VALUE 123456789.
       01 X-P10         PIC 9(10) VALUE 1234567890.
       01 X-P11         PIC 9(11) VALUE 12345678901.
       01 X-P12         PIC 9(12) VALUE 123456789012.
       01 X-P13         PIC 9(13) VALUE 1234567890123.
       01 X-P14         PIC 9(14) VALUE 12345678901234.
       01 X-P15         PIC 9(15) VALUE 123456789012345.
       01 X-P16         PIC 9(16) VALUE 1234567890123456.
       01 X-P17         PIC 9(17) VALUE 12345678901234567.
       01 X-P18         PIC 9(18) VALUE 123456789012345678.
       PROCEDURE        DIVISION.
           DISPLAY X-P1
           END-DISPLAY.
           DISPLAY X-P2
           END-DISPLAY.
           DISPLAY X-P3
           END-DISPLAY.
           DISPLAY X-P4
           END-DISPLAY.
           DISPLAY X-P5
           END-DISPLAY.
           DISPLAY X-P6
           END-DISPLAY.
           DISPLAY X-P7
           END-DISPLAY.
           DISPLAY X-P8
           END-DISPLAY.
           DISPLAY X-P9
           END-DISPLAY.
           DISPLAY X-P10
           END-DISPLAY.
           DISPLAY X-P11
           END-DISPLAY.
           DISPLAY X-P12
           END-DISPLAY.
           DISPLAY X-P13
           END-DISPLAY.
           DISPLAY X-P14
           END-DISPLAY.
           DISPLAY X-P15
           END-DISPLAY.
           DISPLAY X-P16
           END-DISPLAY.
           DISPLAY X-P17
           END-DISPLAY.
           DISPLAY X-P18
           END-DISPLAY.
           STOP RUN.
